When working with large datasets it's used to group and summarize the data to make analysis easier. Pandas a popular Python library provides powerful tools for this. In this article you'll learn how to use Pandas' groupby() and aggregation functions step by step with clear explanations and practical examples.

# Aggregation in Pandas  

Aggregation means applying a mathematical function to summarize data. It can be used to get a summary of columns in our dataset, like getting sum, minimum, maximum, etc., from a particular column.  
The function used for aggregation is **`agg()`**, and the parameter is the function we want to perform.  

Some commonly used aggregation functions are:

| Function      | Description                                              |
|---------------|----------------------------------------------------------|
| `sum()`       | Compute sum of column values                             |
| `min()`       | Compute minimum of column values                         |
| `max()`       | Compute maximum of column values                         |
| `mean()`      | Compute mean (average) of column values                  |
| `size()`      | Compute column sizes                                     |
| `describe()`  | Generate descriptive statistics                          |
| `first()`     | Compute first of group values                            |
| `last()`      | Compute last of group values                             |
| `count()`     | Compute count of column values                           |
| `std()`       | Standard deviation of column values                      |
| `var()`       | Compute variance of column values                        |
| `sem()`       | Standard error of the mean of column values              |

### Creating a Sample Dataset
Let's create a small dataset of student marks in Maths, English, Science and History.

In [2]:
import pandas as pd

df = pd.DataFrame([[9, 4, 8, 9],
                   [8, 10, 7, 6],
                   [7, 6, 8, 5]],
                  columns=['Maths',  'English', 
                           'Science', 'History'])

df

   Maths  English  Science  History
0      9        4        8        9
1      8       10        7        6
2      7        6        8        5

#### 1. Summing Up All Values (sum())
The sum() function adds up all values in each column.

In [4]:
sumOfData=df.sum()
sumOfData

Maths      24
English    20
Science    23
History    20
dtype: int64

#### 2. Getting a Summary (describe())
Instead of calculating sum, mean, min and max separately we can use describe() which provides all important statistics in one go.

In [5]:
df.describe()

       Maths    English   Science   History
count    3.0   3.000000  3.000000  3.000000
mean     8.0   6.666667  7.666667  6.666667
std      1.0   3.055050  0.577350  2.081666
min      7.0   4.000000  7.000000  5.000000
25%      7.5   5.000000  7.500000  5.500000
50%      8.0   6.000000  8.000000  6.000000
75%      8.5   8.000000  8.000000  7.500000
max      9.0  10.000000  8.000000  9.000000

#### 3. Applying Multiple Aggregations at Once (agg())
The .agg() function lets you apply multiple aggregation functions at the same time.

In [6]:
df.agg(['sum','min','mean'])

      Maths    English    Science    History
sum    24.0  20.000000  23.000000  20.000000
min     7.0   4.000000   7.000000   5.000000
mean    8.0   6.666667   7.666667   6.666667

## Grouping in Pandas
Grouping in Pandas means organizing your data into groups based on some columns. Once grouped you can perform actions like finding the total, average, count or even pick the first row from each group. This method follows a split-apply-combine process:

* Split the data into groups
* Apply some calculation like sum, average etc.
* Combine the results into a new table.  
Let’s understand grouping in Pandas using a small bakery order dataset as an example.

In [8]:
data = {
    'Item': ['Cake', 'Cake', 'Bread', 'Pastry', 'Cake'],
    'Flavor': ['Chocolate', 'Vanilla', 'Whole Wheat', 'Strawberry', 'Chocolate'],
    'Price': [250, 220, 80, 120, 250]
}

df = pd.DataFrame(data)
df

     Item       Flavor  Price
0    Cake    Chocolate    250
1    Cake      Vanilla    220
2   Bread  Whole Wheat     80
3  Pastry   Strawberry    120
4    Cake    Chocolate    250

#### 1. Grouping Data by One Column Using groupby()
Let’s say we want to group the orders based on the Item column.

In [10]:
grouped=df.groupby('Item')
grouped

This doesn't show the result directly it just creates a grouped object. To actually see the data we need to apply a method like .sum(), .mean() or first(). Let’s find the total price of each item sold:

In [12]:
grouped=df.groupby('Item')['Price'].sum()
grouped

Item
Bread      80
Cake      720
Pastry    120
Name: Price, dtype: int64

#### 2. Grouping by Multiple Columns
Now let’s group by Item and Flavor to see how each flavored item sold.

In [13]:
grouped=df.groupby(['Item','Flavor'])['Price'].sum()
grouped

Item    Flavor
Bread   Whole Wheat     80
Cake    Chocolate      500
        Vanilla        220
Pastry  Strawberry     120
Name: Price, dtype: int64